Revit 2027 API
MEPAnalyticalNode.Location Property
 The location of this node.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Location { get; }
Public ReadOnly Property Location As XYZ
	Get
public:
property XYZ^ Location {
	XYZ^ get ();
}
member Location : XYZ with get
Property Value
XYZ
See Also
Reference
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace